load_testing_directory/results/summary_results.txt
# Benchmarking Results Summary for Time-Bound Get Requests:

Completed 5000 requests
Finished 9343 requests


Server Software:        Werkzeug/3.1.3
Server Hostname:        
Server Port:            5000

Document Path:          /items
Document Length:        16185 bytes

Concurrency Level:      50
Time taken for tests:   30.013 seconds
Complete requests:      9343
Failed requests:        0
Total transferred:      152802432 bytes
HTML transferred:       151232640 bytes
Requests per second:    311.29 [#/sec] (mean)
Time per request:       160.619 [ms] (mean)
Time per request:       3.212 [ms] (mean, across all concurrent requests)
Transfer rate:          4971.83 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.3      0       2
Processing:    20  160  19.2    161     237
Waiting:        3  143  18.7    144     224
Total:         20  160  19.2    161     237

Percentage of the requests served within a certain time (ms)
  50%    161
  66%    167
  75%    170
  80%    173
  90%    180
  95%    188
  98%    196
  99%    201
 100%    237 (longest request)

# Benchmarking Results Summary for keep-alive Get Requests :

Completed 100 requests
Completed 200 requests
Completed 300 requests
Completed 400 requests
Completed 500 requests
Completed 600 requests
Completed 700 requests
Completed 800 requests
Completed 900 requests
Completed 1000 requests
Finished 1000 requests


Server Software:        Werkzeug/3.1.3
Server Hostname:        
Server Port:            5000

Document Path:          /items
Document Length:        16185 bytes

Concurrency Level:      100
Time taken for tests:   3.464 seconds
Complete requests:      1000
Failed requests:        0
Keep-Alive requests:    0
Total transferred:      16353000 bytes
HTML transferred:       16185000 bytes
Requests per second:    288.68 [#/sec] (mean)
Time per request:       346.402 [ms] (mean)
Time per request:       3.464 [ms] (mean, across all concurrent requests)
Transfer rate:          4610.18 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.3      0       2
Processing:    15  338  51.1    346     484
Waiting:        1  322  50.9    330     470
Total:         16  339  51.1    346     484

Percentage of the requests served within a certain time (ms)
  50%    346
  66%    359
  75%    367
  80%    374
  90%    392
  95%    405
  98%    423
  99%    442
 100%    484 (longest request)

# Benchmarking Results Summary for Custom Header Get Requests:

Completed 100 requests
Completed 200 requests
Completed 300 requests
Completed 400 requests
Completed 500 requests
Finished 500 requests


Server Software:        Werkzeug/3.1.3
Server Hostname:        
Server Port:            5000

Document Path:          /items
Document Length:        16185 bytes

Concurrency Level:      50
Time taken for tests:   1.564 seconds
Complete requests:      500
Failed requests:        0
Total transferred:      8176500 bytes
HTML transferred:       8092500 bytes
Requests per second:    319.71 [#/sec] (mean)
Time per request:       156.391 [ms] (mean)
Time per request:       3.128 [ms] (mean, across all concurrent requests)
Transfer rate:          5105.72 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.3      0       2
Processing:    14  153  30.9    160     222
Waiting:        2  136  30.9    142     195
Total:         14  153  30.8    160     222

Percentage of the requests served within a certain time (ms)
  50%    160
  66%    166
  75%    169
  80%    172
  90%    180
  95%    186
  98%    195
  99%    202
 100%    222 (longest request)

# Benchmarking Results Summary for POST Requests:

Completed 100 requests
Completed 200 requests
Completed 300 requests
Completed 400 requests
Completed 500 requests
Finished 500 requests


Server Software:        Werkzeug/3.1.3
Server Hostname:        
Server Port:            5000

Document Path:          /items
Document Length:        153 bytes

Concurrency Level:      50
Time taken for tests:   0.390 seconds
Complete requests:      500
Failed requests:        0
Non-2xx responses:      500
Total transferred:      185000 bytes
Total body sent:        246500
HTML transferred:       76500 bytes
Requests per second:    1283.19 [#/sec] (mean)
Time per request:       38.965 [ms] (mean)
Time per request:       0.779 [ms] (mean, across all concurrent requests)
Transfer rate:          463.65 [Kbytes/sec] received
                        617.78 kb/s sent
                        1081.44 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.3      0       2
Processing:    13   36   6.5     35      61
Waiting:        2   18   5.6     18      35
Total:         13   37   6.5     35      61

Percentage of the requests served within a certain time (ms)
  50%     35
  66%     38
  75%     41
  80%     42
  90%     46
  95%     47
  98%     48
  99%     55
 100%     61 (longest request)

# Benchmarking Results Summary for High Concurrency Stress:

Completed 1000 requests
Completed 2000 requests
Completed 3000 requests
Completed 4000 requests
Completed 5000 requests
Completed 6000 requests
Completed 7000 requests
Completed 8000 requests
Completed 9000 requests
Completed 10000 requests
Finished 10000 requests


Server Software:        Werkzeug/3.1.3
Server Hostname:       
Server Port:            5000

Document Path:          /items
Document Length:        16185 bytes

Concurrency Level:      500
Time taken for tests:   34.717 seconds
Complete requests:      10000
Failed requests:        0
Total transferred:      163530000 bytes
HTML transferred:       161850000 bytes
Requests per second:    288.04 [#/sec] (mean)
Time per request:       1735.867 [ms] (mean)
Time per request:       3.472 [ms] (mean, across all concurrent requests)
Transfer rate:          4599.93 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    3  40.5      0     517
Processing:   169 1686 302.3   1617    2146
Waiting:        3 1068 451.8   1063    2132
Total:        169 1689 303.7   1617    2146

Percentage of the requests served within a certain time (ms)
  50%   1617
  66%   1625
  75%   1629
  80%   2108
  90%   2122
  95%   2129
  98%   2133
  99%   2137
 100%   2146 (longest request)